erwinbsbqq/PDK_GoDroid/pdk/linux/kernel/thirddrivers/mali/include/shared/m200_td.h
/*
 * This confidential and proprietary software may be used only as
 * authorised by a licensing agreement from ARM Limited
 * (C) COPYRIGHT 2006-2007, 2009-2012 ARM Limited
 * ALL RIGHTS RESERVED
 * The entire notice above must be reproduced on all authorised
 * copies and copies may only be made to the extent permitted
 * by a licensing agreement from ARM Limited.
 */

#ifndef __M200_TD_HEADER__
#define __M200_TD_HEADER__

#include <mali_system.h>
#include "m200_texel_format.h"

#ifdef __cplusplus
extern "C" {
#endif


/** size of Mali 200 texture descriptor in 32-bit words */
#define M200_TD_SIZE (512/32)
/** Expands the given parameters to the ones needed by _m200_td_set, done like this to be calculated in compile-time and to avoid
 *  too complicated usage of function:
 *    clear_mask The mask used to clear the field we are setting a value for
 *    index Which word we are to change
 *    field The mask (starting from 0), used to assert-check that we are not setting anything that will affect other values in the word
 *    left_index Passing of the left_index
 *    right_index Passing of the right_index
 *    right_index_small How many bits to right-shift in this word
 */
#define MALI_TD_SET_PARAMETER_EXPAND( left_index, right_index ) ~( ( ( 1 << ( left_index - right_index + 1 ) ) - 1 ) << ( right_index - ( ( right_index >> 5 ) << 5  ) ) ), ( left_index >> 5 ), ( ( 1 << ( left_index - right_index + 1 ) ) - 1 ), left_index, right_index, ( right_index - ( ( right_index >> 5 ) << 5  ) )

/**
 * @brief
These macros have been generated from the functions that are defined at the bottom of this file
 *
 */
#define MALI_TD_SET_TEXEL_FORMAT( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 5 >> 5 ) == ( 0 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 0, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xffffffc0 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 0 ] = ( (dest)[ 0 ] & 0xffffffc0 ) | ( (val) << 0 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 5, 0 ) == (val), ( "Value set in MALI_TD_SET_TEXEL_FORMAT is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_TEXEL_ORDER_INVERT( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 6 >> 5 ) == ( 6 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 0, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfffffffe & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 0 ] = ( (dest)[ 0 ] & 0xffffffbf ) | ( (val) << 6 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 6, 6 ) == (val), ( "Value set in MALI_TD_SET_TEXEL_ORDER_INVERT is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_TEXEL_RED_BLUE_SWAP( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 7 >> 5 ) == ( 7 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 0, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfffffffe & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 0 ] = ( (dest)[ 0 ] & 0xffffff7f ) | ( (val) << 7 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 7, 7 ) == (val), ( "Value set in MALI_TD_SET_TEXEL_RED_BLUE_SWAP is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_TEXEL_BIAS_SELECT( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 9 >> 5 ) == ( 8 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 0, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfffffffc & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 0 ] = ( (dest)[ 0 ] & 0xfffffcff ) | ( (val) << 8 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 9, 8 ) == (val), ( "Value set in MALI_TD_SET_TEXEL_BIAS_SELECT is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_TEXEL_TOGGLE_MSB( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 10 >> 5 ) == ( 10 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 0, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfffffffe & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 0 ] = ( (dest)[ 0 ] & 0xfffffbff ) | ( (val) << 10 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 10, 10 ) == (val), ( "Value set in MALI_TD_SET_TEXEL_TOGGLE_MSB is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_PALETTE_FORMAT( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 12 >> 5 ) == ( 11 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 0, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfffffffc & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 0 ] = ( (dest)[ 0 ] & 0xffffe7ff ) | ( (val) << 11 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 12, 11 ) == (val), ( "Value set in MALI_TD_SET_PALETTE_FORMAT is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_PALETTE_ADDRESS( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( ( 38 >> 5 ) - 1 ) == ( 13 >> 5 ), ("Value is split into two words that are not in sequence" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 1, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT_RANGE( 0, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfc000000 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 0 ] = ( (dest)[ 0 ] & 0x00001fff ) | ( ( (val) & 0x0007ffff ) << 13 ); \
	(dest)[ 1 ] = ( (dest)[ 1 ] & 0xffffff80 ) | ( (val) >> 19 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 38, 13 ) == (val), ( "Value set in MALI_TD_SET_PALETTE_ADDRESS is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_TEXTURE_FORMAT( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 41 >> 5 ) == ( 39 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 1, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfffffff8 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 1 ] = ( (dest)[ 1 ] & 0xfffffc7f ) | ( (val) << 7 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 41, 39 ) == (val), ( "Value set in MALI_TD_SET_TEXTURE_FORMAT is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_TEXTURE_DIMENSIONALITY( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 43 >> 5 ) == ( 42 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 1, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfffffffc & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 1 ] = ( (dest)[ 1 ] & 0xfffff3ff ) | ( (val) << 10 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 43, 42 ) == (val), ( "Value set in MALI_TD_SET_TEXTURE_DIMENSIONALITY is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_LAMBDA_LOW_CLAMP( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 51 >> 5 ) == ( 44 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 1, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xffffff00 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 1 ] = ( (dest)[ 1 ] & 0xfff00fff ) | ( (val) << 12 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 51, 44 ) == (val), ( "Value set in MALI_TD_SET_LAMBDA_LOW_CLAMP is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_LAMBDA_HIGH_CLAMP( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 59 >> 5 ) == ( 52 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 1, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xffffff00 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 1 ] = ( (dest)[ 1 ] & 0xf00fffff ) | ( (val) << 20 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 59, 52 ) == (val), ( "Value set in MALI_TD_SET_LAMBDA_HIGH_CLAMP is different from what was retrieved\n" ) ); \
} while( 0 );
