erwinbsbqq/PDK_GoDroid/pdk/linux/kernel/thirddrivers/mali/include/shared/m200_td.h
#define MALI_TD_SET_LAMBDA_BIAS( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( ( 68 >> 5 ) - 1 ) == ( 60 >> 5 ), ("Value is split into two words that are not in sequence" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 2, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT_RANGE( 1, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfffffe00 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 1 ] = ( (dest)[ 1 ] & 0x0fffffff ) | ( ( (val) & 0x0000000f ) << 28 ); \
	(dest)[ 2 ] = ( (dest)[ 2 ] & 0xffffffe0 ) | ( (val) >> 4 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 68, 60 ) == (val), ( "Value set in MALI_TD_SET_LAMBDA_BIAS is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_ANISOTROPY_LOG2( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 71 >> 5 ) == ( 69 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 2, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfffffff8 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 2 ] = ( (dest)[ 2 ] & 0xffffff1f ) | ( (val) << 5 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 71, 69 ) == (val), ( "Value set in MALI_TD_SET_ANISOTROPY_LOG2 is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_MIPMAPPING_MODE( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 74 >> 5 ) == ( 73 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 2, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfffffffc & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 2 ] = ( (dest)[ 2 ] & 0xfffff9ff ) | ( (val) << 9 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 74, 73 ) == (val), ( "Value set in MALI_TD_SET_MIPMAPPING_MODE is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_POINT_SAMPLE_MINIFY( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 75 >> 5 ) == ( 75 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 2, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfffffffe & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 2 ] = ( (dest)[ 2 ] & 0xfffff7ff ) | ( (val) << 11 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 75, 75 ) == (val), ( "Value set in MALI_TD_SET_POINT_SAMPLE_MINIFY is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_POINT_SAMPLE_MAGNIFY( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 76 >> 5 ) == ( 76 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 2, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfffffffe & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 2 ] = ( (dest)[ 2 ] & 0xffffefff ) | ( (val) << 12 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 76, 76 ) == (val), ( "Value set in MALI_TD_SET_POINT_SAMPLE_MAGNIFY is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_WRAP_MODE_S( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 79 >> 5 ) == ( 77 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 2, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfffffff8 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 2 ] = ( (dest)[ 2 ] & 0xffff1fff ) | ( (val) << 13 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 79, 77 ) == (val), ( "Value set in MALI_TD_SET_WRAP_MODE_S is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_WRAP_MODE_T( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 82 >> 5 ) == ( 80 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 2, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfffffff8 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 2 ] = ( (dest)[ 2 ] & 0xfff8ffff ) | ( (val) << 16 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 82, 80 ) == (val), ( "Value set in MALI_TD_SET_WRAP_MODE_T is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_WRAP_MODE_R( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 85 >> 5 ) == ( 83 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 2, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfffffff8 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 2 ] = ( (dest)[ 2 ] & 0xffc7ffff ) | ( (val) << 19 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 85, 83 ) == (val), ( "Value set in MALI_TD_SET_WRAP_MODE_R is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_TEXTURE_DIMENSION_S( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( ( 98 >> 5 ) - 1 ) == ( 86 >> 5 ), ("Value is split into two words that are not in sequence" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 3, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT_RANGE( 2, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xffffe000 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 2 ] = ( (dest)[ 2 ] & 0x003fffff ) | ( ( (val) & 0x000003ff ) << 22 ); \
	(dest)[ 3 ] = ( (dest)[ 3 ] & 0xfffffff8 ) | ( (val) >> 10 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 98, 86 ) == (val), ( "Value set in MALI_TD_SET_TEXTURE_DIMENSION_S is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_TEXTURE_DIMENSION_T( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 111 >> 5 ) == ( 99 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 3, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xffffe000 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 3 ] = ( (dest)[ 3 ] & 0xffff0007 ) | ( (val) << 3 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 111, 99 ) == (val), ( "Value set in MALI_TD_SET_TEXTURE_DIMENSION_T is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_TEXTURE_DIMENSION_R( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 124 >> 5 ) == ( 112 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 3, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xffffe000 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 3 ] = ( (dest)[ 3 ] & 0xe000ffff ) | ( (val) << 16 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 124, 112 ) == (val), ( "Value set in MALI_TD_SET_TEXTURE_DIMENSION_R is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_BORDER_COLOR_RED( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( ( 140 >> 5 ) - 1 ) == ( 125 >> 5 ), ("Value is split into two words that are not in sequence" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 4, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT_RANGE( 3, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xffff0000 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 3 ] = ( (dest)[ 3 ] & 0x1fffffff ) | ( ( (val) & 0x00000007 ) << 29 ); \
	(dest)[ 4 ] = ( (dest)[ 4 ] & 0xffffe000 ) | ( (val) >> 3 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 140, 125 ) == (val), ( "Value set in MALI_TD_SET_BORDER_COLOR_RED is different from what was retrieved\n" ) ); \
} while( 0 );
