erwinbsbqq/PDK_GoDroid/pdk/linux/kernel/thirddrivers/mali/include/shared/m200_td.h
#define MALI_TD_SET_BORDER_COLOR_GREEN( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 156 >> 5 ) == ( 141 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 4, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xffff0000 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 4 ] = ( (dest)[ 4 ] & 0xe0001fff ) | ( (val) << 13 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 156, 141 ) == (val), ( "Value set in MALI_TD_SET_BORDER_COLOR_GREEN is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_BORDER_COLOR_BLUE( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( ( 172 >> 5 ) - 1 ) == ( 157 >> 5 ), ("Value is split into two words that are not in sequence" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 5, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT_RANGE( 4, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xffff0000 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 4 ] = ( (dest)[ 4 ] & 0x1fffffff ) | ( ( (val) & 0x00000007 ) << 29 ); \
	(dest)[ 5 ] = ( (dest)[ 5 ] & 0xffffe000 ) | ( (val) >> 3 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 172, 157 ) == (val), ( "Value set in MALI_TD_SET_BORDER_COLOR_BLUE is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_BORDER_COLOR_ALPHA( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 188 >> 5 ) == ( 173 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 5, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xffff0000 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 5 ] = ( (dest)[ 5 ] & 0xe0001fff ) | ( (val) << 13 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 188, 173 ) == (val), ( "Value set in MALI_TD_SET_BORDER_COLOR_ALPHA is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_SHADOW_MAPPING_AMBIENT( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( ( 204 >> 5 ) - 1 ) == ( 189 >> 5 ), ("Value is split into two words that are not in sequence" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 6, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT_RANGE( 5, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xffff0000 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 5 ] = ( (dest)[ 5 ] & 0x1fffffff ) | ( ( (val) & 0x00000007 ) << 29 ); \
	(dest)[ 6 ] = ( (dest)[ 6 ] & 0xffffe000 ) | ( (val) >> 3 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 204, 189 ) == (val), ( "Value set in MALI_TD_SET_SHADOW_MAPPING_AMBIENT is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_TEXTURE_ADDRESSING_MODE( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 206 >> 5 ) == ( 205 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 6, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfffffffc & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 6 ] = ( (dest)[ 6 ] & 0xffff9fff ) | ( (val) << 13 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 206, 205 ) == (val), ( "Value set in MALI_TD_SET_TEXTURE_ADDRESSING_MODE is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_BORDER_TEXEL_ENABLE( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 207 >> 5 ) == ( 207 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 6, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfffffffe & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 6 ] = ( (dest)[ 6 ] & 0xffff7fff ) | ( (val) << 15 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 207, 207 ) == (val), ( "Value set in MALI_TD_SET_BORDER_TEXEL_ENABLE is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_SHADOW_MAPPING_CMP_FUNC( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 210 >> 5 ) == ( 208 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 6, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfffffff8 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 6 ] = ( (dest)[ 6 ] & 0xfff8ffff ) | ( (val) << 16 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 210, 208 ) == (val), ( "Value set in MALI_TD_SET_SHADOW_MAPPING_CMP_FUNC is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_SHADOW_MAPPING_CPY_RGB( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 211 >> 5 ) == ( 211 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 6, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfffffffe & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 6 ] = ( (dest)[ 6 ] & 0xfff7ffff ) | ( (val) << 19 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 211, 211 ) == (val), ( "Value set in MALI_TD_SET_SHADOW_MAPPING_CPY_RGB is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_SHADOW_MAPPING_CPY_ALPHA( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 212 >> 5 ) == ( 212 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 6, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfffffffe & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 6 ] = ( (dest)[ 6 ] & 0xffefffff ) | ( (val) << 20 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 212, 212 ) == (val), ( "Value set in MALI_TD_SET_SHADOW_MAPPING_CPY_ALPHA is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_TEXTURE_STACKING_ENABLE( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 213 >> 5 ) == ( 213 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 6, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfffffffe & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 6 ] = ( (dest)[ 6 ] & 0xffdfffff ) | ( (val) << 21 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 213, 213 ) == (val), ( "Value set in MALI_TD_SET_TEXTURE_STACKING_ENABLE is different from what was retrieved\n" ) ); \
} while( 0 );
