erwinbsbqq/PDK_GoDroid/pdk/linux/kernel/thirddrivers/mali/include/shared/m200_td.h
#define MALI_TD_SET_MIPMAP_ADDRESS_0( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( ( 247 >> 5 ) - 1 ) == ( 222 >> 5 ), ("Value is split into two words that are not in sequence" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 7, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT_RANGE( 6, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfc000000 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 6 ] = ( (dest)[ 6 ] & 0x3fffffff ) | ( ( (val) & 0x00000003 ) << 30 ); \
	(dest)[ 7 ] = ( (dest)[ 7 ] & 0xff000000 ) | ( (val) >> 2 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 247, 222 ) == (val), ( "Value set in MALI_TD_SET_MIPMAP_ADDRESS_0 is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_MIPMAP_ADDRESS_1( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( ( 273 >> 5 ) - 1 ) == ( 248 >> 5 ), ("Value is split into two words that are not in sequence" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 8, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT_RANGE( 7, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfc000000 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 7 ] = ( (dest)[ 7 ] & 0x00ffffff ) | ( ( (val) & 0x000000ff ) << 24 ); \
	(dest)[ 8 ] = ( (dest)[ 8 ] & 0xfffc0000 ) | ( (val) >> 8 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 273, 248 ) == (val), ( "Value set in MALI_TD_SET_MIPMAP_ADDRESS_1 is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_MIPMAP_ADDRESS_2( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( ( 299 >> 5 ) - 1 ) == ( 274 >> 5 ), ("Value is split into two words that are not in sequence" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 9, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT_RANGE( 8, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfc000000 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 8 ] = ( (dest)[ 8 ] & 0x0003ffff ) | ( ( (val) & 0x00003fff ) << 18 ); \
	(dest)[ 9 ] = ( (dest)[ 9 ] & 0xfffff000 ) | ( (val) >> 14 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 299, 274 ) == (val), ( "Value set in MALI_TD_SET_MIPMAP_ADDRESS_2 is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_MIPMAP_ADDRESS_3( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( ( 325 >> 5 ) - 1 ) == ( 300 >> 5 ), ("Value is split into two words that are not in sequence" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 10, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT_RANGE( 9, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfc000000 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 9 ] = ( (dest)[ 9 ] & 0x00000fff ) | ( ( (val) & 0x000fffff ) << 12 ); \
	(dest)[ 10 ] = ( (dest)[ 10 ] & 0xffffffc0 ) | ( (val) >> 20 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 325, 300 ) == (val), ( "Value set in MALI_TD_SET_MIPMAP_ADDRESS_3 is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_MIPMAP_ADDRESS_4( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 351 >> 5 ) == ( 326 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 10, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfc000000 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 10 ] = ( (dest)[ 10 ] & 0x0000003f ) | ( (val) << 6 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 351, 326 ) == (val), ( "Value set in MALI_TD_SET_MIPMAP_ADDRESS_4 is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_MIPMAP_ADDRESS_5( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 377 >> 5 ) == ( 352 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 11, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfc000000 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 11 ] = ( (dest)[ 11 ] & 0xfc000000 ) | ( (val) << 0 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 377, 352 ) == (val), ( "Value set in MALI_TD_SET_MIPMAP_ADDRESS_5 is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_MIPMAP_ADDRESS_6( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( ( 403 >> 5 ) - 1 ) == ( 378 >> 5 ), ("Value is split into two words that are not in sequence" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 12, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT_RANGE( 11, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfc000000 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 11 ] = ( (dest)[ 11 ] & 0x03ffffff ) | ( ( (val) & 0x0000003f ) << 26 ); \
	(dest)[ 12 ] = ( (dest)[ 12 ] & 0xfff00000 ) | ( (val) >> 6 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 403, 378 ) == (val), ( "Value set in MALI_TD_SET_MIPMAP_ADDRESS_6 is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_MIPMAP_ADDRESS_7( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( ( 429 >> 5 ) - 1 ) == ( 404 >> 5 ), ("Value is split into two words that are not in sequence" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 13, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT_RANGE( 12, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfc000000 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 12 ] = ( (dest)[ 12 ] & 0x000fffff ) | ( ( (val) & 0x00000fff ) << 20 ); \
	(dest)[ 13 ] = ( (dest)[ 13 ] & 0xffffc000 ) | ( (val) >> 12 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 429, 404 ) == (val), ( "Value set in MALI_TD_SET_MIPMAP_ADDRESS_7 is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_MIPMAP_ADDRESS_8( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( ( 455 >> 5 ) - 1 ) == ( 430 >> 5 ), ("Value is split into two words that are not in sequence" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 14, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT_RANGE( 13, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfc000000 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 13 ] = ( (dest)[ 13 ] & 0x00003fff ) | ( ( (val) & 0x0003ffff ) << 14 ); \
	(dest)[ 14 ] = ( (dest)[ 14 ] & 0xffffff00 ) | ( (val) >> 18 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 455, 430 ) == (val), ( "Value set in MALI_TD_SET_MIPMAP_ADDRESS_8 is different from what was retrieved\n" ) ); \
} while( 0 );
