erwinbsbqq/PDK_GoDroid/pdk/linux/kernel/thirddrivers/mali/include/shared/m200_td.h
#define MALI_TD_SET_MIPMAP_ADDRESS_9( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( ( 481 >> 5 ) - 1 ) == ( 456 >> 5 ), ("Value is split into two words that are not in sequence" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 15, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT_RANGE( 14, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfc000000 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 14 ] = ( (dest)[ 14 ] & 0x000000ff ) | ( ( (val) & 0x00ffffff ) << 8 ); \
	(dest)[ 15 ] = ( (dest)[ 15 ] & 0xfffffffc ) | ( (val) >> 24 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 481, 456 ) == (val), ( "Value set in MALI_TD_SET_MIPMAP_ADDRESS_9 is different from what was retrieved\n" ) ); \
} while( 0 );
#define MALI_TD_SET_MIPMAP_ADDRESS_10( dest, val ) do { \
	MALI_DEBUG_ASSERT( ( 507 >> 5 ) == ( 482 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 15, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == ( 0xfc000000 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[ 15 ] = ( (dest)[ 15 ] & 0xf0000003 ) | ( (val) << 2 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 507, 482 ) == (val), ( "Value set in MALI_TD_SET_MIPMAP_ADDRESS_10 is different from what was retrieved\n" ) ); \
} while( 0 );


/** MALI200 doesn't support texture stride for linear textures
 *  Texture stride will this only be set when target platform is MALI400
 */
#ifdef MALI200_HWVER

#define MALI_TD_SET_TEXTURE_TOGGLE_STRIDE(dest, val)
#define MALI_TD_SET_TEXTURE_STRIDE(dest, val)

#elif defined(MALI400_HWVER)

#define MALI_TD_SET_TEXTURE_TOGGLE_STRIDE(dest, val) do { \
	MALI_DEBUG_ASSERT( ( 72 >> 5 ) == ( 72 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 2, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == (0xfffffffe & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[2] = ( (dest)[ 2 ] & ~0x00000100 ) | ( ( val ) << 8 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 72, 72 ) == (val), ( "Valule set in MALI_TD_SET_TEXTURE_TOGGLE_PITCH is different from what was retrieved\n" ) ); \
} while( 0 );

#define MALI_TD_SET_TEXTURE_STRIDE(dest, val) do { \
	MALI_DEBUG_ASSERT( ( 31 >> 5 ) == ( 16 >> 5 ), ("Value is split into two words, should use split into two functions" ) ); \
	MALI_DEBUG_ASSERT_RANGE( 0, 0, M200_TD_SIZE - 1 ); \
	MALI_DEBUG_ASSERT( 0 == (0xffff0000 & (val) ), ("Bitfield given is too large for the field") ); \
	(dest)[0] = ( (dest)[ 0 ] & 0x0000ffff ) | ( ( val ) << 16 ); \
	MALI_DEBUG_ASSERT( _m200_td_get( (dest), 31, 16 ) == (val), ( "Value set in MALI_TD_SET_TEXTURE_PITCH is different from what was retrieved\n" ) ); \
} while( 0 );

#endif


#define MALI_TD_GET_TEXEL_FORMAT( dest ) _m200_td_get( dest, 5, 0 )
#define MALI_TD_GET_TEXEL_ORDER_INVERT( dest ) _m200_td_get( dest, 6, 6 )
#define MALI_TD_GET_TEXEL_RED_BLUE_SWAP( dest ) _m200_td_get( dest, 7, 7 )
#define MALI_TD_GET_TEXEL_BIAS_SELECT( dest ) _m200_td_get( dest, 9, 8 )
#define MALI_TD_GET_TEXEL_TOGGLE_MSB( dest ) _m200_td_get( dest, 10, 10 )
#define MALI_TD_GET_PALETTE_FORMAT( dest ) _m200_td_get( dest, 12, 11 )
#define MALI_TD_GET_TEXTURE_STRIDE ( dest ) _m200_td_get( dest, 31, 16 )
#define MALI_TD_GET_PALETTE_ADDRESS( dest ) _m200_td_get( dest, 38, 13 )
#define MALI_TD_GET_TEXTURE_FORMAT( dest ) _m200_td_get( dest, 41, 39 )
#define MALI_TD_GET_TEXTURE_DIMENSIONALITY( dest ) _m200_td_get( dest, 43, 42 )
#define MALI_TD_GET_LAMBDA_LOW_CLAMP( dest ) _m200_td_get( dest, 51, 44 )
#define MALI_TD_GET_LAMBDA_HIGH_CLAMP( dest ) _m200_td_get( dest, 59, 52 )
#define MALI_TD_GET_LAMBDA_BIAS( dest ) _m200_td_get( dest, 68, 60 )
#define MALI_TD_GET_ANISOTROPY_LOG2( dest ) _m200_td_get( dest, 71, 69 )
#define MALI_TD_GET_TEXTURE_TOGGLE_STRIDE ( dest ) _m200_td_get( dest, 72, 72 )
#define MALI_TD_GET_MIPMAPPING_MODE( dest ) _m200_td_get( dest, 74, 73 )
#define MALI_TD_GET_POINT_SAMPLE_MINIFY( dest ) _m200_td_get( dest, 75, 75 )
#define MALI_TD_GET_POINT_SAMPLE_MAGNIFY( dest ) _m200_td_get( dest, 76, 76 )
#define MALI_TD_GET_WRAP_MODE_S( dest ) _m200_td_get( dest, 79, 77 )
#define MALI_TD_GET_WRAP_MODE_T( dest ) _m200_td_get( dest, 82, 80 )
#define MALI_TD_GET_WRAP_MODE_R( dest ) _m200_td_get( dest, 85, 83 )
#define MALI_TD_GET_TEXTURE_DIMENSION_S( dest ) _m200_td_get( dest, 98, 86 )
#define MALI_TD_GET_TEXTURE_DIMENSION_T( dest ) _m200_td_get( dest, 111, 99 )
#define MALI_TD_GET_TEXTURE_DIMENSION_R( dest ) _m200_td_get( dest, 124, 112 )
#define MALI_TD_GET_BORDER_COLOR_RED( dest ) _m200_td_get( dest, 140, 125 )
#define MALI_TD_GET_BORDER_COLOR_GREEN( dest ) _m200_td_get( dest, 156, 141 )
#define MALI_TD_GET_BORDER_COLOR_BLUE( dest ) _m200_td_get( dest, 172, 157 )
#define MALI_TD_GET_BORDER_COLOR_ALPHA( dest ) _m200_td_get( dest, 188, 173 )
#define MALI_TD_GET_SHADOW_MAPPING_AMBIENT( dest ) _m200_td_get( dest, 204, 189 )
#define MALI_TD_GET_TEXTURE_ADDRESSING_MODE( dest ) _m200_td_get( dest, 206, 205 )
#define MALI_TD_GET_BORDER_TEXEL_ENABLE( dest ) _m200_td_get( dest, 207, 207 )
#define MALI_TD_GET_SHADOW_MAPPING_CMP_FUNC( dest ) _m200_td_get( dest, 210, 208 )
#define MALI_TD_GET_SHADOW_MAPPING_CPY_RGB( dest ) _m200_td_get( dest, 211, 211 )
#define MALI_TD_GET_SHADOW_MAPPING_CPY_ALPHA( dest ) _m200_td_get( dest, 212, 212 )
#define MALI_TD_GET_TEXTURE_STACKING_ENABLE( dest ) _m200_td_get( dest, 213, 213 )
#define MALI_TD_GET_MIPMAP_ADDRESS_0( dest ) _m200_td_get( dest, 247, 222 )
#define MALI_TD_GET_MIPMAP_ADDRESS_1( dest ) _m200_td_get( dest, 273, 248 )
#define MALI_TD_GET_MIPMAP_ADDRESS_2( dest ) _m200_td_get( dest, 299, 274 )
#define MALI_TD_GET_MIPMAP_ADDRESS_3( dest ) _m200_td_get( dest, 325, 300 )
#define MALI_TD_GET_MIPMAP_ADDRESS_4( dest ) _m200_td_get( dest, 351, 326 )
#define MALI_TD_GET_MIPMAP_ADDRESS_5( dest ) _m200_td_get( dest, 377, 352 )
#define MALI_TD_GET_MIPMAP_ADDRESS_6( dest ) _m200_td_get( dest, 403, 378 )
#define MALI_TD_GET_MIPMAP_ADDRESS_7( dest ) _m200_td_get( dest, 429, 404 )
#define MALI_TD_GET_MIPMAP_ADDRESS_8( dest ) _m200_td_get( dest, 455, 430 )
#define MALI_TD_GET_MIPMAP_ADDRESS_9( dest ) _m200_td_get( dest, 481, 456 )
#define MALI_TD_GET_MIPMAP_ADDRESS_10( dest ) _m200_td_get( dest, 507, 482 )

/** Mali 200 texture descriptor data block */
typedef u32 m200_td[M200_TD_SIZE];

/** If all compare enums are the same (like in 110, we can just create a compare enum instead of this */
typedef enum m200_shadow_mapping_compare_func {
	M200_SHADOW_MAPPING_COMPARE_FUNC_ALWAYS_FAIL = 0,
	M200_SHADOW_MAPPING_COMPARE_FUNC_LESS_THAN = 1,
	M200_SHADOW_MAPPING_COMPARE_FUNC_EQUAL = 2,
	M200_SHADOW_MAPPING_COMPARE_FUNC_LESS_THAN_OR_EQUAL = 3,
	M200_SHADOW_MAPPING_COMPARE_FUNC_GREATER_THAN = 4,
	M200_SHADOW_MAPPING_COMPARE_FUNC_NOT_EQUAL = 5,
	M200_SHADOW_MAPPING_COMPARE_FUNC_GREATER_THAN_OR_EQUAL = 6,
	M200_SHADOW_MAPPING_COMPARE_FUNC_ALWAYS_SUCCEED = 7
} m200_shadow_mapping_compare_function;

/** */
typedef enum m200_texture_format {
	M200_TEXTURE_FORMAT_NORMALIZED = 0,
	M200_TEXTURE_FORMAT_NON_NORMALIZED = 1,
	M200_TEXTURE_FORMAT_NORMALIZED_SHADOW_MAP = 2,
	M200_TEXTURE_FORMAT_NON_NORMALIZED_SHADOW_MAP = 3,
	M200_TEXTURE_FORMAT_CUBE_MAP = 4
	/*Perlin noise not implemented
	M200_TEXTURE_FORMAT_PERLIN_NOISE = 5,
	enums 6-7 reserved for future expansion */
} m200_texture_format;

/** */
typedef enum m200_texel_bias {
	M200_TEXEL_BIAS_NONE = 0,
	M200_TEXEL_BIAS_X_MINUS_HALF = 1,
	M200_TEXEL_BIAS_X_MINUS_HALF_X2 = 2,
	M200_TEXEL_BIAS_ONE_MINUS_X = 3
} m200_texel_bias;

/** */
typedef enum m200_palette_format {
	M200_PALETTE_FORMAT_RGB_565 = 0,
	M200_PALETTE_FORMAT_ARGB_1555 = 1,
	M200_PALETTE_FORMAT_ARGB_4444 = 2
	/* Not implemented
	M200_PALETTE_FORMAT_ARGB_8888 = 3, */
} m200_palette_format;

/** */
typedef enum m200_texture_addressing_mode {
	M200_TEXTURE_ADDRESSING_MODE_LINEAR = 0,
	M200_TEXTURE_ADDRESSING_MODE_2D_INTERLEAVED = 1,
	M200_TEXTURE_ADDRESSING_MODE_3D_INTERLEAVED = 2,
	M200_TEXTURE_ADDRESSING_MODE_16X16_BLOCKED = 3,
	M200_TEXTURE_ADDRESSING_MODE_INVALID = 4
} m200_texture_addressing_mode;

/** */
typedef enum m200_mipmap_mode {
	M200_MIPMAP_MODE_NEAREST = 0,
	M200_MIPMAP_MODE_DITHER = 1,
	M200_MIPMAP_MODE_PERFORMANCE_TRILINEAR = 2,
	M200_MIPMAP_MODE_QUALITY_TRILINEAR = 3
} m200_mipmap_mode;

/** */
typedef enum m200_texture_wrap_mode {
	M200_TEXTURE_WRAP_MODE_REPEAT = 0,
	M200_TEXTURE_WRAP_MODE_CLAMP_TO_EDGE = 1,
	M200_TEXTURE_WRAP_MODE_CLAMP_TO_ZERO_ONE = 2,
	M200_TEXTURE_WRAP_MODE_CLAMP_TO_BORDER = 3,
	M200_TEXTURE_WRAP_MODE_MIRRORED_REPEAT = 4,
	M200_TEXTURE_WRAP_MODE_MIRRORED_CLAMP_TO_EDGE = 5,
	M200_TEXTURE_WRAP_MODE_MIRRORED_CLAMP_TO_MINUS_1_1 = 6,
	M200_TEXTURE_WRAP_MODE_MIRRORED_CLAMP_TO_BORDER = 7
} m200_texture_wrap_mode;

/** */
typedef enum m200_texture_dimensionality {
	M200_TEXTURE_DIMENSIONALITY_1D = 0,
	M200_TEXTURE_DIMENSIONALITY_2D = 1,
	M200_TEXTURE_DIMENSIONALITY_3D = 2
	/* **not implemented** supported for Perlin noise only
	M200_TEXTURE_DIMENSIONALITY_4D = 3
	*/
} m200_texture_dimensionality;

/**
 * Set default values for all fields in texture descriptor.
 * Fields that are not explicitly listed below defaults to zero.
 *	texel_format = M200_TEXEL_FORMAT_xRGB_8888
 *	bias_select = M200_TEXEL_BIAS_NONE
 *	paletted_format = M200_PALETTE_FORMAT_RGB_565
 *	texture_format = M200_TEXTURE_FORMAT_NORMALIZED
 *	texture_dimensionality = M200_TEXTURE_DIMENSIONALITY_2D
 *	mipmapping_mode = M200_MIPMAP_MODE_NEAREST
 *	wrap_mode_s = M200_TEXTURE_WRAP_MODE_CLAMP_TO_EDGE
 *	wrap_mode_t = M200_TEXTURE_WRAP_MODE_CLAMP_TO_EDGE
 *	wrap_mode_r = M200_TEXTURE_WRAP_MODE_CLAMP_TO_EDGE
 *	texture_dimension_s = 1
 *	texture_dimension_t = 1
 *	texture_dimension_r = 1
 *	addressing_mode = M200_TEXTURE_ADDRESSING_MODE_LINEAR
 *	shadowmap_compare_func = M200_SHADOW_MAPPING_COMPARE_FUNC_ALWAYS_FAIL
 * @param dest
 */
MALI_IMPORT void m200_texture_descriptor_set_defaults( m200_td dest );

MALI_IMPORT u32 _m200_td_get(m200_td dest, u32 left_index, u32 right_index );

#ifdef __cplusplus
}
#endif

#ifdef DEBUG
/**
 * print textur descriptor to stdout
 * @param desc tex. desc. to print
 */
MALI_IMPORT void m200_td_print( m200_td dest );
#else
#define m200_td_print( desc )	((void)0)
#endif

#if 0 /* Code needed to regenerate macros for setting and getting */
void print_it( char *name, int left_index, int right_index )
{
	if ( ( left_index >> 5 ) != ( right_index >> 5 ) )
	{
		u32 right_split_index = ( ( left_index >> 5 ) << 5 ) - 1;
		u32 left_split_index = ( ( left_index >> 5 ) << 5 );
		u32 right_clear_mask = ~( ( ( 1 << 	( right_split_index - right_index + 1 ) ) - 1 ) << ( right_index - 	( ( right_index >> 5 ) << 5 ) ) );
		u32 left_clear_mask = ~( ( ( 1 << ( left_index - left_split_index + 1 ) ) - 1 ) );
		u32 right_word = ( right_index >> 5 );
		u32 left_word = ( left_index >> 5 );
		u32 right_field = ( ( 1 << ( right_split_index - right_index + 1 ) ) - 1 );
		u32 left_field = ( ( 1 << ( left_index - left_split_index + 1 ) ) - 1 );
		u32 field = ( ( 1 << ( left_index - right_index + 1 ) ) - 1 );
		u32 right_index_small = ( right_index - ( ( right_index >> 5 ) << 5  ) );
		u32 left_shift_small = right_split_index - right_index + 1;
#if 0
		printf("#ifdef MALI_TEST_API\n");
#endif
		printf("#define MALI_TD_SET_%s( dest, val ) do { \\\n", name );
		printf("\tMALI_DEBUG_ASSERT( ( ( %d >> 5 ) - 1 ) == ( %d >> 5 ), (\"Value is split into two words that are not in sequence\" ) ); \\\n", left_index, right_index );
		printf("\tMALI_DEBUG_ASSERT_RANGE( %d, 0, M200_TD_SIZE - 1 ); \\\n", left_word );
		printf("\tMALI_DEBUG_ASSERT_RANGE( %d, 0, M200_TD_SIZE - 1 ); \\\n", right_word);
		printf("\tMALI_DEBUG_ASSERT( 0 == ( 0x%08x & (val) ), (\"Bitfield given is too large for the field\") ); \\\n", ~field );
		printf("\t(dest)[ %d ] = ( (dest)[ %d ] & 0x%08x ) | ( ( (val) & 0x%08x ) << %d ); \\\n", right_word, right_word, right_clear_mask, right_field, right_index_small );
		printf("\t(dest)[ %d ] = ( (dest)[ %d ] & 0x%08x ) | ( (val) >> %d ); \\\n", left_word, left_word, left_clear_mask, left_shift_small );
		printf("\tMALI_DEBUG_ASSERT( _m200_td_get( (dest), %d, %d ) == (val), ( \"Value set in MALI_TD_SET_%s is different from what was retrieved\\n\" ) ); \\\n", left_index, right_index, name );
		printf("} while( 0 ); \n");
#if 0
		printf("#else\n");
		printf("\t#define MALI_TD_SET_%s( dest, (val) ) \\\n", name );
		printf("\t\t(dest)[ %d ] = ( (dest)[ %d ] & 0x%08x ) | ( ( (val) & 0x%08x ) << %d ) \\\n", right_word, right_word, right_clear_mask, right_field, right_index_small );
		printf("\t\t(dest)[ %d ] = ( (dest)[ %d ] & 0x%08x ) | ( (val) >> %d )\n", left_word, left_word, left_clear_mask, left_shift_small);
		printf("#endif\n");
#endif
	}
	else
	{
		u32 clear_mask = ~( ( ( 1 << ( left_index - right_index + 1 ) ) - 1 ) << ( right_index - ( ( right_index >> 5 ) << 5  ) ) );
		u32 index = 	( left_index >> 5 );
		u32 field = ( ( 1 << ( left_index - right_index + 1 ) ) - 1 );
		u32 right_index_small = ( right_index - ( ( right_index >> 5 ) << 5  ) );
#if 0
		printf("#ifdef MALI_TEST_API\n");
#endif
		printf("#define MALI_TD_SET_%s( dest, val ) do { \\\n", name );
		printf("\tMALI_DEBUG_ASSERT( ( %d >> 5 ) == ( %d >> 5 ), (\"Value is split into two words, should use split into two functions\" ) ); \\\n", left_index, right_index );
		printf("\tMALI_DEBUG_ASSERT_RANGE( %d, 0, M200_TD_SIZE - 1 ); \\\n", index );
		printf("\tMALI_DEBUG_ASSERT( 0 == ( 0x%08x & (val) ), (\"Bitfield given is too large for the field\") ); \\\n", ~field );
		printf("\t(dest)[ %d ] = ( (dest)[ %d ] & 0x%08x ) | ( (val) << %d ); \\\n", index, index, clear_mask, right_index_small );
		printf("\tMALI_DEBUG_ASSERT( _m200_td_get( (dest), %d, %d ) == (val), ( \"Value set in MALI_TD_SET_%s is different from what was retrieved\\n\" ) ); \\\n", left_index, right_index, name );
		printf("} while( 0 ); \n");
#if 0
		printf("#else\n");
		printf("\t#define MALI_TD_SET_%s( dest, (val) ) \\\n", name );
		printf("\t\t(dest)[ %d ] = ( (dest)[ %d ] & 0x%08x ) | ( (val) << %d )\n", index, index, clear_mask, right_index_small );
		printf("#endif\n");
#endif
	}
}
static int used[ 508 ];
static int forste = 1;
void print_it2( char *name, int left_index, int right_index )
{

