erwinbsbqq/PDK_GoDroid/pdk/linux/kernel/thirddrivers/mali/include/shared/m200_td.h
	int i;

	if ( forste == 1 )
	{
		forste = 0;
		for ( i = 0; i <= 507; i++ )
		{
			used[ i ] = 0;
		}
	}
	for ( i = right_index; i <= left_index; i++ )
	{
		used[ i ]++;
	}
	printf("#define MALI_TD_GET_%s( dest ) _m200_td_get( dest, %d, %d )\n", name, left_index, right_index );
}
void print_all_of_them( )
{
	print_it( "TEXEL_FORMAT", 5, 0 );
	print_it( "TEXEL_ORDER_INVERT", 6, 6 );
	print_it( "TEXEL_RED_BLUE_SWAP", 7, 7 );
	print_it( "TEXEL_BIAS_SELECT", 9, 8 );
	print_it( "TEXEL_TOGGLE_MSB", 10, 10 );
	print_it( "PALETTE_FORMAT", 12, 11 );
	print_it( "TEXTURE_STRIDE", 31, 16 );
	print_it( "PALETTE_ADDRESS", 38, 13 );
	print_it( "TEXTURE_FORMAT", 41, 39 );
	print_it( "TEXTURE_DIMENSIONALITY", 43, 42 );
	print_it( "LAMBDA_LOW_CLAMP", 51, 44 );
	print_it( "LAMBDA_HIGH_CLAMP", 59, 52 );
	print_it( "LAMBDA_BIAS", 68, 60 );
	print_it( "ANISOTROPY_LOG2", 71, 69 );
	print_it( "TEXTURE_TOGGLE_STRIDE", 72, 72 );
	print_it( "MIPMAPPING_MODE", 74, 73 );
	print_it( "POINT_SAMPLE_MINIFY", 75, 75 );
	print_it( "POINT_SAMPLE_MAGNIFY", 76, 76 );
	print_it( "WRAP_MODE_S", 79, 77 );
	print_it( "WRAP_MODE_T", 82, 80 );
	print_it( "WRAP_MODE_R", 85, 83 );
	print_it( "TEXTURE_DIMENSION_S", 98, 86 );
	print_it( "TEXTURE_DIMENSION_T", 111, 99 );
	print_it( "TEXTURE_DIMENSION_R", 124, 112 );
	print_it( "BORDER_COLOR_RED", 140, 125 );
	print_it( "BORDER_COLOR_GREEN", 156, 141 );
	print_it( "BORDER_COLOR_BLUE", 172, 157 );
	print_it( "BORDER_COLOR_ALPHA", 188, 173 );
	print_it( "SHADOW_MAPPING_AMBIENT", 204, 189 );
	print_it( "TEXTURE_ADDRESSING_MODE", 206, 205 );
	print_it( "BORDER_TEXEL_ENABLE", 207, 207 );
	print_it( "SHADOW_MAPPING_CMP_FUNC", 210, 208 );
	print_it( "SHADOW_MAPPING_CPY_RGB", 211, 211 );
	print_it( "SHADOW_MAPPING_CPY_ALPHA", 212, 212 );
	print_it( "TEXTURE_STACKING_ENABLE", 213, 213 );
	print_it( "MIPMAP_ADDRESS_0", 247, 222 );
	print_it( "MIPMAP_ADDRESS_1", 273, 248 );
	print_it( "MIPMAP_ADDRESS_2", 299, 274 );
	print_it( "MIPMAP_ADDRESS_3", 325, 300 );
	print_it( "MIPMAP_ADDRESS_4", 351, 326);
	print_it( "MIPMAP_ADDRESS_5", 377, 352 );
	print_it( "MIPMAP_ADDRESS_6", 403, 378 );
	print_it( "MIPMAP_ADDRESS_7", 429, 404 );
	print_it( "MIPMAP_ADDRESS_8", 455, 430 );
	print_it( "MIPMAP_ADDRESS_9", 481, 456 );
	print_it( "MIPMAP_ADDRESS_10", 507, 482 );
#if 0
	{
		int i;
		for ( i = 0; i <= 507; i++ )
		{
			if ( used[ i ] == 0 )
			{
				_mali_sys_printf("word %d is reserved perhaps?\n", i );

			}
			else if ( used[ i ] > 1 )
			{
				_mali_sys_printf("word %d has been used several times\n", i );
			}
		}
	}
#endif
fflush(stdout);
while( 1 );
}
#endif

#endif /* __M200_TD_HEADER__ */
